In [3]:
import pandas as pd
df = pd.read_csv('sales_data_with_issues.csv')
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,176558,Flatscreen TV,3.0,84.41,2023-01-01,"570 Main St, New York, NY"
1,176559,Wired Headphones,2.0,1593.83,2023-01-02,"242 Main St, Portland, OR"
2,176560,Macbook Pro Laptop,2.0,790.31,2023-01-03,"191 Main St, Los Angeles, CA"
3,176561,Flatscreen TV,4.0,1274.87,2023-01-04,"453 Main St, New York, NY"
4,176562,Google Phone,2.0,2270.37,2023-01-05,"933 Main St, Portland, OR"

In [6]:
missing_values = df.isnull().sum()
print(missing_values)

Order ID            0
Product             0
Quantity Ordered    2
Price Each          1
Order Date          0
Purchase Address    0
dtype: int64

In [7]:
df[df.isnull().any(axis=1)]

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
5,176563,Varely Earbuds,NaN,627.97,2023-01-06,"899 Main St, Miami, FL"
10,176568,Google Phone,4.0,NaN,2023-01-11,"797 Main St, Seattle, WA"
25,176583,AAA Batteries (4-pack),NaN,1071.62,2023-01-26,"712 Main St, New York, NY"

In [8]:
df[df['Price Each'] < 0]

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
20,176578,AAA Batteries (4-pack),4.0,-50.0,2023-01-21,"781 Main St, Portland, OR"

In [10]:
invalid_dates = df[~df['Order Date'].str.match(r'^\d{4}-\d{2}-\d{2}$', na=False)]
display(invalid_dates)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
15,176573,Macbook Pro Laptop,4.0,2180.28,INVALID_DATE,"413 Main St, Miami, FL"